cf/Catalogs/РангиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РангиКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/РангиКлиентов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = ПроверитьПравильностьЗаполненияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеФункции

&НаКлиенте
Функция ПроверитьПравильностьЗаполненияФормы()
	
	Отказ = Ложь;
	
	Если Объект.СуммаОт >= Объект.СуммаДо Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Значение ""Сумма от"" не может быть больше или равно ""Суммы до""";
		Сообщение.Поле = "СуммаОт";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
	
	Если Объект.Группа = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Значение ""Группа"" не может быть равным 0";
		Сообщение.Поле = "Группа";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;

	Возврат Отказ;
	
КонецФункции

#КонецОбласти
